STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * File Name          : app_thread.c
  * Description        : Thread Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <assert.h>

#include "app_conf.h"
#include "app_common.h"
#include "app_entry.h"
#include "app_thread.h"
#include "dbg_trace.h"
#include "stm32_rtos.h"
#include "stm32_timer.h"
#include "common_types.h"
#include "instance.h"
#include "cli.h"
#include "radio.h"
#include "platform.h"
#include "tasklet.h"
#include "ll_sys_startup.h"
#include "event_manager.h"
#include "platform_wba.h"
#include "coap.h"
#include "link.h"
#include "thread.h"
#include "coap.h"
#include "log_module.h"
#include "joiner.h"
#include "alarm.h"
#include OPENTHREAD_CONFIG_FILE

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32wbaxx_nucleo.h"
#include "data_transfer.h"
#include "udp.h"
#include "app_bsp.h"
#ifdef OT_CLI_USE
#include "uart.h"
#endif /* OT_CLI_USE */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define C_SIZE_CMD_STRING       256U
#define C_PANID                 0xBA98U
#define C_CHANNEL_NB            16U
#define C_CCA_THRESHOLD         -70

/* USER CODE BEGIN PD */
#define C_RESSOURCE             "light"
#define COAP_PAYLOAD_LENGTH      2

/* Enable periodic CoAp message transmission to Thread Leader */
#define APP_THREAD_PERIODIC_TRANSMIT

#ifdef APP_THREAD_PERIODIC_TRANSMIT
#define APP_THREAD_TRANSMIT_PERIOD      (1*1000)        /**< 1000ms */
#endif
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void APP_THREAD_DeviceConfig(void);
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext);
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode);

/* USER CODE BEGIN PFP */
static void APP_THREAD_CoapSendRequest( otCoapResource        * aCoapRessource,
                                        otCoapType            aCoapType,
                                        otCoapCode            aCoapCode,
                                        const char            * aStringAddress,
                                        const otIp6Address    * aPeerAddress,
                                        uint8_t               * aPayload,
                                        uint16_t              Size,
                                        otCoapResponseHandler aHandler,
                                        void                  * aContext);

static void APP_THREAD_CoapRequestHandler(  void                * pContext,
                                            otMessage           * pMessage,
                                            const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapSendDataResponse(otMessage           * pMessage,
                                            const otMessageInfo * pMessageInfo);

#if (CFG_BUTTON_SUPPORTED == 1)
static void APP_THREAD_CoapDataRespHandler( void                * aContext,
                                            otMessage           * pMessage,
                                            const otMessageInfo * pMessageInfo,
                                            otError             result);
#endif

static void APP_THREAD_InitPayloadWrite(void);
static void APP_THREAD_SendCoapMsgWithNoConf(void);
#if (CFG_BUTTON_SUPPORTED == 1)
static void APP_THREAD_SendCoapMsgWithConf(void);
#endif
static bool APP_THREAD_CheckMsgValidity(void);
#ifdef APP_THREAD_PERIODIC_TRANSMIT
static void APP_THREAD_TransmitRequest(void *arg);
#endif

#if (OT_CLI_USE == 1)
static void APP_THREAD_CliInit(otInstance *aInstance);
static void APP_THREAD_ProcessUart(void);
#endif /* OT_CLI_USE */

/* USER CODE END PFP */

/* Private variables -----------------------------------------------*/
static otInstance * PtOpenThreadInstance;

/* USER CODE BEGIN PV */
static otCoapResource OT_Ressource = {C_RESSOURCE, APP_THREAD_CoapRequestHandler, "MyOwnContext", NULL};
static otMessageInfo OT_MessageInfo = {0};
static otMessage* pOT_Message = NULL;
static otMessage* pOT_MessageResponse = NULL;

static uint8_t PayloadWrite[COAP_PAYLOAD_LENGTH]= {0};
static uint8_t PayloadRead[COAP_PAYLOAD_LENGTH]= {0};

#ifdef APP_THREAD_PERIODIC_TRANSMIT
osTimerId_t APP_Thread_transmitTimerHandle;
#endif

const osThreadAttr_t stAlarmTaskAttributes = 
{
  .name = "Alarm Task",
  .priority = CFG_TASK_PRIO_ALARM,
  .stack_size = TASK_ALARM_STACK_SIZE
};

const osThreadAttr_t stUsAlarmTaskAttributes = 
{
  .name = "UsAlarm Task",
  .priority = CFG_TASK_PRIO_US_ALARM,
  .stack_size = TASK_ALARM_US_STACK_SIZE
};

const osThreadAttr_t stTaskletsTaskAttributes = 
{
  .name = "Tasklets Task",
  .priority = CFG_TASK_PRIO_TASKLETS,
  .stack_size = TASK_TASKLETS_STACK_SIZE
};

const osThreadAttr_t stCliUartTaskAttributes = 
{
  .name = "CliUart Task",
  .priority = CFG_TASK_PRIO_CLI_UART,
  .stack_size = TASK_CLI_UART_STACK_SIZE
};

const osThreadAttr_t stSendCoapMsgTaskAttributes = 
{
  .name = "SendCoapMsg Task",
  .priority = CFG_TASK_PRIO_SEND_COAP_MSG,
  .stack_size = TASK_SEND_COAP_MSG_STACK_SIZE
};

osSemaphoreId_t       AlarmSemaphore, UsAlarmSemaphore;
osThreadId_t          AlarmTaskId, UsAlarmTaskId;

osSemaphoreId_t       CliUartSemaphore, TaskletsSemaphore, SendCoapMsgSemaphore;
os_thread_id          CliUartTaskId, TaskletsTaskId, SendCoapMsgTaskId; 

/* USER CODE END PV */

/* Functions Definition ------------------------------------------------------*/
#if (OT_CLI_USE == 1)
/**
 * @brief   Background Task for Cli Uart.
 */
static void Cli_Uart_Task( void * argument )
{
  UNUSED(p_param);  
  while(1)
  {
    /* Wait for task semaphore to be released */
    osSemaphoreAcquire( CliUartSemaphore, osWaitForever );
    APP_THREAD_ProcessUart();
    osThreadYield();
  }
}
#endif // (OT_CLI_USE == 1)

