STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/STM32_WPAN/App/app_thread.c
void APP_THREAD_ScheduleAlarm(void)
{
  osSemaphoreRelease(AlarmSemaphore);
}

void APP_THREAD_ScheduleUsAlarm(void)
{
  osSemaphoreRelease(UsAlarmSemaphore);
}

/**
 * @brief   Background Task for Alarm.
 */
static void Alarm_Task( void * argument )
{
  UNUSED(p_param);  
  while(1)
  {
    /* Wait for task semaphore to be released */
    osSemaphoreAcquire( AlarmSemaphore, osWaitForever );
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    ProcessAlarm();
    osMutexRelease(LinkLayerMutex);
    osThreadYield();
  }
}

/**
 * @brief   Background Task for US Alarm.
 */
static void Us_Alarm_Task( void * argument )
{
  UNUSED(p_param);  
  while(1)
  {
    /* Wait for task semaphore to be released */
    osSemaphoreAcquire( UsAlarmSemaphore, osWaitForever );
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    ProcessUsAlarm();
    osMutexRelease(LinkLayerMutex);
    osThreadYield();
  }
}

/**
 * @brief   Background Task for Tasklets.
 */
static void Tasklets_Task( void * argument )
{
  UNUSED(p_param);
  while(1)
  {
    /* Wait for task semaphore to be released */
    osSemaphoreAcquire( TaskletsSemaphore, osWaitForever );
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    ProcessOpenThreadTasklets();
    osMutexRelease(LinkLayerMutex);
    osThreadYield();
  }
}

/**
 * @brief   Background Task for Send Coap Messages.
 */
static void Send_Coap_Msg_Task( void * argument )
{
  UNUSED(p_param);  
  while(1)
  {
    /* Wait for task semaphore to be released */
    osSemaphoreAcquire( SendCoapMsgSemaphore, osWaitForever );
    APP_THREAD_SendCoapMsgWithNoConf();
    osThreadYield();
  }
}

void Thread_Init(void)
{
#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
  size_t otInstanceBufferLength = 0;
  uint8_t *otInstanceBuffer = NULL;
#endif

  otSysInit(0, NULL);

#if OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
  // Call to query the buffer size
  (void)otInstanceInit(NULL, &otInstanceBufferLength);

  // Call to allocate the buffer
  otInstanceBuffer = (uint8_t *)malloc(otInstanceBufferLength);
  assert(otInstanceBuffer);

  // Initialize OpenThread with the buffer
  PtOpenThreadInstance = otInstanceInit(otInstanceBuffer, &otInstanceBufferLength);
#else
  PtOpenThreadInstance = otInstanceInitSingle();
#endif

  assert(PtOpenThreadInstance);

#if (OT_CLI_USE == 1)
  APP_THREAD_CliInit(PtOpenThreadInstance);
#endif

  otDispatch_tbl_init(PtOpenThreadInstance);

  /* Register tasks */ 
  
#if (OT_CLI_USE == 1)
  /* Create thread for cli uart and semaphore to control it*/
  CliUartSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( CliUartSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : CLI UART SEMAPHORE CREATION FAILED" );
    while(1);
  }  

  CliUartTaskId = osThreadNew( Cli_Uart_Task, NULL, &stCliUartTaskAttributes );
  if ( CliUartTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : CLI UART TASK CREATION FAILED" );
    while(1);
  }  
#endif
  /* Create thread for Alarm and semaphore to control it*/
  AlarmSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( AlarmSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : ALARM SEMAPHORE CREATION FAILED" );
    while(1);
  }  

  AlarmTaskId = osThreadNew( Alarm_Task, NULL, &stAlarmTaskAttributes );
  if ( AlarmTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : ALARM TASK CREATION FAILED" );
    while(1);
  }  
  
  /* Create thread for US Alarm and semaphore to control it*/
  UsAlarmSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( UsAlarmSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : US ALARM SEMAPHORE CREATION FAILED" );
    while(1);
  }  

  UsAlarmTaskId = osThreadNew( Us_Alarm_Task, NULL, &stUsAlarmTaskAttributes );
  if ( UsAlarmTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : US ALARM TASK CREATION FAILED" );
    while(1);
  } 

  /* Create thread for Tasklets and semaphore to control it*/
  TaskletsSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( TaskletsSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : TASKLETS SEMAPHORE CREATION FAILED" );
    while(1);
  }  

  TaskletsTaskId = osThreadNew( Tasklets_Task, NULL, &stTaskletsTaskAttributes );
  if ( TaskletsTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : TASKLETS TASK CREATION FAILED" );
    while(1);
  }

  ll_sys_thread_init();

  /* Run first time */
  osSemaphoreRelease(AlarmSemaphore);
  osSemaphoreRelease(TaskletsSemaphore);
#if (OT_CLI_USE == 1)
  osSemaphoreRelease(CliUartSemaphore);
#endif

  /* USER CODE BEGIN INIT TASKS */
#ifdef APP_THREAD_PERIODIC_TRANSMIT
  /* Create thread for periodic CoAp msg transmission and semaphore to control it*/
  SendCoapMsgSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( SendCoapMsgSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : SEND COAP MESSAGES SEMAPHORE CREATION FAILED" );
    while(1);
  }  

  SendCoapMsgTaskId = osThreadNew( Send_Coap_Msg_Task, NULL, &stSendCoapMsgTaskAttributes );
  if ( SendCoapMsgTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : SEND COAP MESSAGES TASK CREATION FAILED" );
    while(1);
  }

  /* Create timer to handle periodic CoAp msg transmission */
  APP_Thread_transmitTimerHandle = osTimerNew(APP_THREAD_TransmitRequest, osTimerPeriodic, NULL, NULL);
#endif
  /* USER CODE END INIT TASKS */

}

void ProcessAlarm(void)
{
  arcAlarmProcess(PtOpenThreadInstance);
}

void ProcessUsAlarm(void)
{
  arcUsAlarmProcess(PtOpenThreadInstance);
}

void ProcessTasklets(void)
{
  if (otTaskletsArePending(PtOpenThreadInstance) == TRUE)
  {
    osSemaphoreRelease(TaskletsSemaphore);
  }
}

/**
 * @brief  ProcessOpenThreadTasklets.
 * @param  None
 * @param  None
 * @retval None
 */
void ProcessOpenThreadTasklets(void)
{
  /* wakeUp the system */
  //ll_sys_radio_hclk_ctrl_req(LL_SYS_RADIO_HCLK_LL_BG, LL_SYS_RADIO_HCLK_ON);
  //ll_sys_dp_slp_exit();

  /* process the tasklet */
  otTaskletsProcess(PtOpenThreadInstance);

  /* Put the IP802_15_4 back to sleep mode */
  //ll_sys_radio_hclk_ctrl_req(LL_SYS_RADIO_HCLK_LL_BG, LL_SYS_RADIO_HCLK_OFF);

  /* Reschedule the tasklets if any */
  ProcessTasklets();
}

/**
 * OpenThread calls this function when the tasklet queue transitions from empty to non-empty.
 *
 * @param[in] aInstance A pointer to an OpenThread instance.
 */
void otTaskletsSignalPending(otInstance *aInstance)
{
  osSemaphoreRelease(TaskletsSemaphore);
}

void APP_THREAD_Init( void )
{
  Thread_Init();

  APP_THREAD_DeviceConfig();
}

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error = OT_ERROR_NONE;
  otNetworkKey networkKey = {{0xFF, 0xEE, 0xDD, 0xCC, 0xBB, 0xAA, 0x99, 0x88, 0x77, 0x66, 0x55, 0x44, 0x33, 0x22, 0x11, 0x00}};


  error = otSetStateChangedCallback(PtOpenThreadInstance, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }

  error = otPlatRadioSetCcaEnergyDetectThreshold(PtOpenThreadInstance, C_CCA_THRESHOLD);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_THRESHOLD,error);
  }

  error = otLinkSetChannel(PtOpenThreadInstance, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }

  error = otLinkSetPanId(PtOpenThreadInstance, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }

  error = otThreadSetNetworkKey(PtOpenThreadInstance, &networkKey);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_NETWORK_KEY,error);
  }

